app/views/users/new.html.erb

<%= f.label :events %>
<%= f.collection_select :event_ids, Event.all, :id, :event_name, prompt: true %>
---
SELECT "events".* FROM "events"