app/views/users/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "user_events" ON "events"."id" = "user_events"."event_id" WHERE "user_events"."user_id" = ?  [["user_id", 6]]
---
<br>
<% @user.events.each do |event|  %>