app/views/events/edit.html.erb

SELECT "activities".* FROM "activities"
---
<%= f.label :activities %>
<%= f.collection_select :activity_ids, Activity.all, :id, :title, prompt: true, activity_ids: [] %>

SELECT "users".* FROM "users"
---
<%= f.label :users %>
<%= f.collection_select :user_ids, User.all, :id, :name, prompt: true%>