app/views/events/new.html.erb

<%= f.label :users %>
<%= f.collection_select :user_ids, User.all, :id, :name, prompt: true %>
---
SELECT "users".* FROM "users"

<%= f.label :activities %>
<%= f.collection_select :activity_ids, Activity.all, :id, :title, prompt: true %>
---
SELECT "activities".* FROM "activities"