app/views/events/show.html.erb

SELECT "activities".* FROM "activities" INNER JOIN "event_activities" ON "activities"."id" = "event_activities"."activity_id" WHERE "event_activities"."event_id" = ?  [["event_id", 7]]
---
<br>
<% @event.activities.each do |activity| %>

SELECT "users".* FROM "users" INNER JOIN "user_events" ON "users"."id" = "user_events"."user_id" WHERE "user_events"."event_id" = ?  [["event_id", 4]]
---
<br>
<% @event.users.each do |user| %>