app/views/static/analytics.html.erb

SELECT COUNT(*) FROM "users"
---
              <%=  event.event_name %> :
            <%=  event.users.count %>