app/views/static/analytics.html.erb

<%= image_tag("math.gif", :size => '600x300', :align=> "center")%>
<% @events = Event.all %>
---
SELECT "events".* FROM "events"

      <%=  event.event_name %> :
      <%=  event.users.count %>
---
SELECT "users".* FROM "users" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "user_events" ON "users"."id" = "user_events"."user_id" WHERE "user_events"."event_id" = ?  [["event_id", 1]]

<strong> Total Events :</strong>
      <% @events = Event.all %>
---
SELECT "events".* FROM "events"

<strong> Total Activities :</strong>
      <% @activities = Activity.all %>
---
SELECT "activities".* FROM "activities" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

<h6><strong>* Calendar of Events *</strong></h6>
      <% @events = Event.all %>
---
SELECT "events".* FROM "events"

<h6><strong>* Random User *</strong></h6>
      <%= User.order(Arel.sql('RANDOM()')).first.name %>
---
SELECT "users".* FROM "users" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

<h6><strong>* Random Event *</strong></h6>
      <%= Event.order(Arel.sql('RANDOM()')).first.event_name%>
---
SELECT "events".* FROM "events" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

<h6><strong>* Random Activity *</strong></h6>
      <%= Activity.order(Arel.sql('RANDOM()')).first.title %>
---
SELECT "activities".* FROM "activities" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]