app/controllers/activities_controller.rb

  def create
    @activity = Activity.new(activity_params)
    @activities = Activity.all
    if @activity.save
---
SELECT "activities".* FROM "activities"
INSERT INTO "activities" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rainey Street"], ["description", "Best house bars in Austin!"], ["created_at", "2020-03-03 02:35:30.638992"], ["updated_at", "2020-03-03 02:35:30.638992"]]

  def edit
    @activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def show
    @activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def update
    @activity = Activity.find(params[:id])
    @event = Event.find(user_params[:event_ids])

    if @activity.update_attributes(activity_params)
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "activities" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["title", "COTA"], ["description", "Take a hot lap or two!"], ["updated_at", "2020-03-03 03:11:21.719531"], ["id", 11]]

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 7]]