app/controllers/events_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["event_id", 5], ["created_at", "2020-03-03 20:39:36.902584"], ["updated_at", "2020-03-03 20:39:36.902584"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "events" INNER JOIN "user_events" ON "events"."id" = "user_events"."event_id" WHERE "user_events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 5], ["id", 9], ["LIMIT", 1]]
---
  def create
    @event = Event.new(event_params)
    @user = User.find(event_params[:user_ids])

    if @event.save
      @user.events << @event unless @user.events.include? @event

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 9], ["event_id", 5], ["created_at", "2020-03-04 20:17:49.357426"], ["updated_at", "2020-03-04 20:17:49.357426"]]
SELECT "activities".* FROM "activities" INNER JOIN "event_activities" ON "activities"."id" = "event_activities"."activity_id" WHERE "event_activities"."event_id" = ?  [["event_id", 1]]
INSERT INTO "event_activities" ("event_id", "activity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 4], ["activity_id", "5"], ["created_at", "2020-03-03 20:13:55.118530"], ["updated_at", "2020-03-03 20:13:55.118530"]]
SELECT 1 AS one FROM "activities" INNER JOIN "event_activities" ON "activities"."id" = "event_activities"."activity_id" WHERE "event_activities"."event_id" = ? AND "activities"."id" = ? LIMIT ?  [["event_id", 4], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "event_activities" ("event_id", "activity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 1], ["activity_id", "1"], ["created_at", "2020-03-03 19:18:30.337254"], ["updated_at", "2020-03-03 19:18:30.337254"]]
---
  def update
    @event = Event.find(params[:id])
    @activity = Activity.find(event_params[:activity_ids])
    @user = User.find(event_params[:user_ids])

    if @event.valid?
      @event.activities << @activity unless @event.activities.include? @activity
      @user.events << @event unless @user.events.include? @event

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "activities".* FROM "activities"
---
  def show
    @event = Event.find(params[:id])
    @activities = Activity.all

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 5]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy