app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @event = Event.find(user_params[:event_ids])

    if @user.save
      @event.users << @user unless @event.users.include? @user
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "users" ("name", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sky"], ["role", "Host"], ["created_at", "2020-03-03 21:09:00.925150"], ["updated_at", "2020-03-03 21:09:00.925150"]]
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 7], ["event_id", 6], ["created_at", "2020-03-03 21:09:00.928478"], ["updated_at", "2020-03-03 21:09:00.928478"]]
SELECT 1 AS one FROM "users" INNER JOIN "user_events" ON "users"."id" = "user_events"."user_id" WHERE "user_events"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 6], ["id", 7], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    @event = Event.find(user_params[:event_ids])


    if @user.valid?
      @user.events << @event unless @user.events.include? @event
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]