app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Tommy"], ["updated_at", "2020-03-03 20:41:52.424298"], ["id", 2]]